{
  "quizSrc": [
    {
    "term": "Due to the ___________ nature of qualitative research, there is no agreed process in designing a qualitative research project. To this end, researchers can use certain design principles in designing their qualitative projects. Unstructured Numerical Rigid Structured",
    "definition": "Unstructured"
}, {
    "term": "All researchers commence their research with an issue or _________, investigate the relevant empirical evidence and literature to identify relevant research evidence which will help in designing the qualitative questions, collect data and analyse them. Data set Methods Solution Problem",
    "definition": "Solution"
}, {
    "term": "Several aspects of a qualitative research project vary from researcher to researcher. For instance, the empirical evidence and the literature may be reviewed to inform the questions initially raised or it may be reviewed at a late stage during the research process or it may be used to highlight the importance of the research problem. Another consideration regarding qualitative research is the structure and writing of the qualitative project. This varies across different approaches such as ___________ and performances including theatre and poems. Focus groups Interviews Storytelling Problem-solving",
    "definition": "Storytelling"
}, {
    "term": "Fill in the blank word. The in-depth ___________ does not have the restrictions of a group process and in this vein, new streams of ___________and questioning can be developed at any time. Advice Participants Interviews Questionnaires",
    "definition": "Interviews"
}, {
    "term": "Fill in the blank word. __________ interviews offer more flexibility and new ways of gathering insights. The close and personal interaction permits the interviewer to be more sensitive and open to nonverbal feedback and body language. With personal interviews, a personal point of view can be gathered without the influence of others. The interview can be conducted in any place and no certain or demanding preparations are needed. Group Personal Quick Structured",
    "definition": "Personal"
}, {
    "term": "Fill in the blank word. The success of an in-depth interview depends on the _______ of the interviewer. Skills Accent Questions Charisma",
    "definition": "Skills"
}, {
    "term": "Question 4 The unstructured nature of the interview necessitates the researcher to have the competence in gathering and ___________the information collected. Writing Interpreting Remembering Paraphrasing",
    "definition": "Interpreting"
}, {
    "term": "Qualitative research is popular in market research due to the fact that there is no better way to understand the in-depth motivations and feelings of consumers. 1 point True False",
    "definition": "True"
}, {
    "term": "The design of a qualitative study commences with broad ___________ regarding the qualitative ___________ and the theoretical lens which shape and direct the study. Assumptions. Inquiry Inspirations. Assumptions Dreams. Assumptions Details. Structure Hypotheses. Dialogue.",
    "definition": "Assumptions. Inquiry"
}, {
    "term": "Soon after the collection and the storing of the data, the research team proceeds with the analysis of such data in relation to different perspectives such as, A._______themes, B.________dimensions, codes or categories. Hypotheses. Propositions. Themes. Dimensions. Groups. Segments. Markets. Units. Groups. Propositions.",
    "definition": "Themes. Dimensions."
}, {
    "term": "In-depth interviews can reveal hidden motivations and are considered one of the most popular data collection approaches in qualitative research. True False",
    "definition": "True"
}, {
    "term": "The individual one-to-one interaction offers the interviewee the opportunity to be the focus of attention and to feel that their feelings and point of view are important and they are really important for the research project. True False",
    "definition": "True"
}, {
    "term": "Fill in the blank word. Survey approaches are based upon the design and development of well _________ questionnaires. Key informants may be asked several questions with respect to their intentions, motivations, attitudes, demographic and lifestyle characteristics among others. The questions may be asked verbally in writing or through a remote device (e.g., laptop) and the responses may be collected through these ways. Structured Arranged Standardised Directed",
    "definition": "Structured"
}, {
    "term": "Structured refers to the level of __________ that is used during the data collection procedure. Standardisation Collaboration Creativity Variation",
    "definition": "Standardisation"
}, {
    "term": "In structured data collection a formal research instrument is developed and the different questions are offered in a ___________order. Pre-arranged Random",
    "definition": "Pre-arranged"
}, {
    "term": "The research can be classified as _________ or __________ based upon whether the objective of the research is known to the respondents. Direct or indirect Fixed or changing Structured or unstructured Standardised or random",
    "definition": "Direct or indirect"
}, {
    "term": "Question 5 In a survey questionnaire, the vast majority of questions are _________ responses that require the respondent to select the answer from a prearranged set of responses. For instance, a question designed to operationalise consumer perceptions regarding a product may be read as follows: The nutrition value of product X is high and the answers are anchored in a 5 point Likert type scale ranging from strongly disagree (1) to strongly agree (5). Easy Obvious Obscure Fixed",
    "definition": "Fixed"
}, {
    "term": "By investigating attitudes and behaviours using a case study approach through different points of time refers to a longitudinal case study methodology. True False",
    "definition": "True"
}, {
    "term": "The reflection on the action research cycle should be evaluated in terms of ___________, quality of relationships, quality of action research process and outcomes Context Attitude Motivation Beliefs Perceptions",
    "definition": "Context"
}, {
    "term": "In an action research project during the ___________stage the plans are implemented and interventions are made collaboratively between the researcher and the research participants. Plan Reflect Act Pre-step Observe",
    "definition": "Act"
}, {
    "term": "The general empirical approach in action research includes ____________that is demonstrated in activities such as attending, sensing, and imaging. Acting Decision Understanding Experience Judgement",
    "definition": "Experience"
}, {
    "term": "Question 5 Survey questionnaires can be administered through the use of different modes. Those being, telephone interviews, personal interviews, mail interviews and online interviews True False",
    "definition": "True"
}, {
    "term": "The sampling design procedure commences with a number of steps which are interrelated. These steps include the definition of the target population, the __________, and the selection of sampling approaches. Sampling frame Individuals Research Items",
    "definition": "Sampling frame"
}, {
    "term": "___________ refers to the representation of the various elements of the target population. It consists of a set of guidelines in specifying the target population. Sampling frame Research Dimension Item",
    "definition": "Sampling frame"
}, {
    "term": "An example of a sampling frame concerns a __________or a mailing list. Customer database Variable Concept Item",
    "definition": "Customer database"
}, {
    "term": "_________ is adopted in order to make the collected data more representative of the target population regarding certain attributes. Weighting Fixing Analysing Experimenting",
    "definition": "Weighting"
}, {
    "term": "___________ sampling is a probability sample which is distinguished by the following processes: the original population is divided into two or more mutually exclusive and exhaustive subsets (e.g., males and females) and simple random samples of elements from two or more subsets are selected independently of each other. Cluster Stratified Single Random Systematic",
    "definition": "Stratified"
}, {
    "term": "Stratified sampling is a two-step approach where the population is divided into subpopulations or _________. Groups Division Strata Elements",
    "definition": "Strata"
}, {
    "term": "Each element of the population should be allocated to one and only one _________stratum and no population elements should be omitted. Item Group Element Stratum",
    "definition": "Stratum"
}, {
    "term": "In _________ sampling the target population is initially divided to mutually exclusive and collectively exhaustive subpopulations. Stratified Cluster Systematic Single Random",
    "definition": "Cluster"
}, {
    "term": "To define the ____________ focuses on the collection of elements which possess the information that is sought by the researcher. Research Target population Sample Target aim Items",
    "definition": "Target population"
}, {
    "term": "A(n) ___________ refers to the representation of the various elements of the target population. It consists of a set of guidelines in specifying the target population. Population Target Item Element Sampling frame",
    "definition": "Sampling frame"
}, {
    "term": "Non response error appears when some of the potential key informants included in the sample do not respond. True False",
    "definition": "True"
}, {
    "term": "In single random sampling the known and equal probability is calculated as follows: Probability of selection=sample size/population size. True False",
    "definition": "True"
}, {
    "term": "_______________sampling is a probability sample which is distinguished by the following processes: the original population is divided into two or more mutually exclusive and exhaustive subsets (e.g., males and females) and simple random samples of elements from two or more subsets are selected independently of each other. Simple random Judgemental Stratified Experimental Cluster",
    "definition": "Stratified"
}, {
    "term": "___________ sampling is a type of non-probability sampling which is also known as chain-referral sampling. As the first step in snowball sampling the market researcher forms a first group of research participants by identifying the individuals who will participate in the systematic investigation. Cluster Snowball Random Experimental",
    "definition": "Snowball"
}, {
    "term": "A well-developed research instrument can enhance the response rate and reduce ____________ to participate in the research study. If the research instrument and the whole experience in completing the questionnaire is pleasant for the research participants, the response rate can improve. Refusals Willingness Follow-ups Suggestions",
    "definition": "Refusals"
}, {
    "term": "Well-trained researchers can enhance response rates and increase ____________ and persuasion of key informants. Follow up or contacting the non-respondents periodically, works well in eliminating refusals and convince individuals to participate in the research project. A reminder may be sent to non-respondents to complete the questionnaire. Suggestions Refusals Follow ups Conversion",
    "definition": "Conversion"
}, {
    "term": "Response rates can be increased through the adoption of __________to research participants. Questionnaires Incentives Promises Suggestions",
    "definition": "Incentives"
}, {
    "term": "A well-developed research instrument can enhance the response rate and reduce ____________ to participate in the research study. If the research instrument and the whole experience in completing the questionnaire is pleasant for the research participants, the response rate can improve. Refusals Willingness Follow ups Suggestions",
    "definition": "Refusals"
}, {
    "term": "Well-trained researchers can enhance response rates and increase ____________ and persuasion of key informants. Follow up or contacting the non-respondents periodically, works well in eliminating refusals and convince individuals to participate in the research project. A reminder may be sent to non respondents to complete the questionnaire. Refusals Conversion Follow ups Suggestions",
    "definition": "Conversion"
}, {
    "term": "Question 1 ____________ sampling is considered as a two stage restricted judgemental sampling which is adopted extensively in street interviewing. Random Quota Convenience Non probability Probability",
    "definition": "Quota"
}, {
    "term": "The correct answer is quota, because quota sampling is considered as a two stage restricted judgemental sampling which is adopted extensively in street interviewing. Quota Snowball Judgemental Convenience Random",
    "definition": "Snowball"
}, {
    "term": "Non respondents may be different from respondents in terms of certain demographics such as, demographics, personality and perceptions. In case that the non respondents differ significantly with respondents it means that the sample is significantly biassed. Increased response rates usually imply lower rates of non-response bias. True False",
    "definition": "True"
}, {
    "term": "In exponential discriminative snowball sampling the market researcher screens very carefully the individuals before accepting them in the final sample. True False",
    "definition": "True"
}, {
    "term": "Well trained researchers can enhance __________ rates and increase conversion and persuasion of key informants. Response Percentage Question Questionnaire Performance",
    "definition": "Response"
}, {
    "term": "_________ is defined as the process of identifying constructive associations, patterns and trends emerging from accumulated amounts of collected data stored in repositories, through the adoption of pattern recognition and statistical and mathematical approaches. Data mining Data reading Data analysis Data cleaning",
    "definition": "Data mining"
}, {
    "term": "__________ refer to organisations which gather and sell pools of data and information which are developed to address information requirements and needs. Data Texts Syndicated sources Analyses",
    "definition": "Syndicated sources"
}, {
    "term": "____________focus on electronic devices which automatically record behaviour and are supplemented by a diary. Such data are used for creating media programmes on air time and developing viewer profiles. Diary media panels Focus groups Interviews",
    "definition": "Diary media panels"
}, {
    "term": "Market research assists companies in moving in the right manner, and in this vein, companies can use the collected information in order to improve strategic decision making and to improve customer ____________. Metrics Satisfaction Appearance Focus",
    "definition": "Satisfaction"
}, {
    "term": "Gathered market research data should be integrated with other research data coming from both __________ and external sources to make the most of their use and to make more confident strategic decision making. Internal External Mixed Experimental",
    "definition": "Internal"
}, {
    "term": "The budget scheduled for research should be considered and in this vein, if there are limited research resources more cost efficient ways of collecting data to be considered including __________ data collection approaches. Right market research data assist companies in better connecting with their customers and attract new customers. Internal External Automated Manual",
    "definition": "Automated"
}, {
    "term": "A ____________ include(s) a collection of different and integrated databases developed in supporting decision making and solving of problems. The data which are included can be accessed through data mining approaches. Datawarehouse Warehouse Record Research document Syndicated services",
    "definition": "Datawarehouse"
}, {
    "term": "Question 2 Industrial firms focus on data banks of industrial establishments developed through the direct inquiries of companies, clipping services and corporate reports. Such information and data can be used to assess market potential around geographic areas, define sales territories and decide on the advertising budget. Customer Consumer Manufacturing Advertising Industrial",
    "definition": "Industrial"
}, {
    "term": "Audit services focus on the verification of product movement by investigating physical records or performing inventory analysis. Such data are used to measure sales and assess market share and track the performance of new products or services. True False",
    "definition": "True"
}, {
    "term": "Mail diary panels refer to information which comes from households and such information is offered for an extended period of time and in this vein the key informants are required to record behaviour as it takes place. Syndicated services Mail diary panels Industrial services Audit services Secondary data",
    "definition": "Mail diary panels"
}, {
    "term": "The combination of survey data and databases help the organisation to identify the nature and scope of different customer segments, understand the nature of the factors which influence the needs of customer groups, and reflect on best practices regarding target market decisions. True False",
    "definition": "True"
}, {
    "term": "__________is defined as the procedure of placing key informants to a continuum regarding their attitude towards a certain product or product line. Measuring Assessing Scaling Reconfiguring",
    "definition": "Scaling"
}, {
    "term": "A _________scale is a figurative labelling scheme in which numbers serve as labels or tags in order to identify and classify objects. Nominal Ordinal Ratio Interval",
    "definition": "Nominal"
}, {
    "term": "_________scale is a scale where the numbers used to rank objects such as numerically equal distances on the scale demonstrate equal distances in the attribute being measured. Interval Nominal Ordinal Ratio",
    "definition": "Interval"
}, {
    "term": "__________scaling focuses on two objects which the respondents are asked to select one according to some criterion. Ordinal Paired comparison Nominal Likert",
    "definition": "Paired comparison"
}, {
    "term": "The development of a ___________scale commences with a concept which should be rated, such as the image of a brand or the quality of a service. The market researcher chooses opposite pairs of words or phrases (for instance, reliable (1) to unreliable (7)) which could be used to capture the concept. As a next step, respondents rate the concept on a scale which is usually anchored from 1 to 7. Semantic differential Likert Nominal Ordinal",
    "definition": "Semantic differential"
}, {
    "term": "In _________scale a single adjective (e.g., user friendly, high quality) is located in the centre of the scale which usually is a 10 point scale that ranges from +5 to -5. The approach is designed to operationalise the direction and the intensity of the attitudes at the same time. Likert Stapel Ordinal Nominal",
    "definition": "Stapel"
}, {
    "term": "The _______scale consists of a number of statements that communicate a favourable or unfavourable attitude toward the concept that is under investigation. Ordinal Likert Semantic differential Stapel",
    "definition": "Likert"
}, {
    "term": "______________ focuses on the assignment of numbers or other symbols to attributes of objects in concert to specific pre-specified rules. Assessment Scaling Measurement Editing Assessment",
    "definition": "Measurement"
}, {
    "term": "An __________ scale is a ranking scale in which numbers are allocated to objects to demonstrate the degree to which objects have some attributes. And permits to identify whether an object has more or less of an attribute than some other object, but not how much more or less. An example of such a scale is the ranking of service quality offered by a number of banks Ordinal Ratio Interval Nominal None of the above",
    "definition": "Ordinal"
}, {
    "term": "Non comparative scaling techniques include the semantic differential scale, the stapel scale and the __________ scale. Q-sort Rank order Paired comparison Likert Constant sum",
    "definition": "Likert"
}, {
    "term": "____________scale is a comparative scale in which key informants are requested to assign a constant sum of units such as points, euros, or dollars among a set of stimulus objects regarding some criterion. Ordinal Nominal Semantic differential Likert Constant sum",
    "definition": "Constant sum"
}, {
    "term": "____________scales entail the comparison of different objects. For instance key informants may be asked to indicate if they prefer Coca Cola or Pepsi. 1 point Semantic differential Comparative Likert Nominal Stapel",
    "definition": "Comparative"
}, {
    "term": "Under the spectrum of a ___________case study, the researcher concentrates on an issue or concern and as a next step chooses a bounded case study to depict the case. Longitudinal Attitudinal Single instrumental Random",
    "definition": "Single instrumental"
}, {
    "term": "In a collective case study or _________case study the issue to be investigated is selected but the researcher chooses a number of case studies to depict the issue. Such an action helps to investigate different aspects of the issue under investigation. Attitudinal Experimental Multiple Random",
    "definition": "Multiple"
}, {
    "term": "Qualitative researchers are reluctant to generalise the cases from one context to another because the contexts of the various cases are different. If the intention is to generalise, the qualitative researcher should select ____________ cases to be considered in the qualitative study. Representative Internal Mixed External",
    "definition": "Representative"
}, {
    "term": "Phenomenologists identify a phenomenon which serves as an object or the unit of analysis and is related to an individual ___________. Experience Feelings Observation Stories",
    "definition": "Experience"
}, {
    "term": "The combination of both the ___________ and structural descriptions offer the whole essence of the experience with the phenomenon. Textural Natural Empirical Thematic",
    "definition": "Textural"
}, {
    "term": "The intrinsic case study focuses on the case itself due to the fact that the case presents an unusual or unique situation. Such a situation may be to study a customer who is unique or evaluating a marketing programme. Extrinsic Multiple Single Intrinsic Extensive",
    "definition": "Intrinsic"
}, {
    "term": "The collection of data under a _____________methodology, is an extensive process and is based on multiple sources of information including interviews, observations, documentation and audiovisual. Interview Focus group Case study Survey Experiment",
    "definition": "Case study"
}, {
    "term": "Under the spectrum of ___________phenomenology, everything is perceived as 'fresh' and the experiences of the researchers are left aside. Hermeneutical Natural Intrinsic Extrinsic In depth",
    "definition": "Hermeneutical"
}, {
    "term": "In phenomenology apart from the _________, alternative data collection tools can be observations, journals, reports, and music. Focus groups Surveys Experiments Observations Interviews",
    "definition": "Interviews"
}, {
    "term": "In phenomenology, the significant statements and themes are used to write a description regarding the experiences of the participants. This is called textural description. Structural Ethical Textural Psychological Empirical",
    "definition": "Textural"
}, {
    "term": "The __________process is based upon the stages of the action research cycle which consists of a number of different stages. Action research Case study Focus groups Interviews Experiments",
    "definition": "Action research"
}, {
    "term": "In action research, it is essential to construct the initiative with pertinent stakeholders and to produce and gather research data regarding an ongoing system that is relevant to an objective or a need or requirement; _________with others in order to review the data which was collected. Engaging Speaking Checking Replacing",
    "definition": "Engaging"
}, {
    "term": "Two popular types of ethnography include realist ethnography and _________ ethnography. Critical Similar Internal External",
    "definition": "Critical"
}, {
    "term": "_________ethnography represents an objective picture of a situation such as customer reactions towards a branded product, with the objective of reporting the information learned by research participants in the research field. Under this type of ethnography, the ethnographer narrates the study in third-person and objectively reports what has been discovered by the research participants. The researcher reports the collected information without any personal bias. The ethnographer generates the research participants point of view by using carefully edited quotations and should objectively communicate and interpret the group culture that is being analysed. Internal External Positivist Realist",
    "definition": "Realist"
}, {
    "term": "Critical ethnography is researchers who are politically minded people who aim to use their research to speak against ___________. Critical ethnographers may research brands and their relationships with customers. Ethnographic research can offer an accurate understanding of consumer behaviour which helps with the modelling of branding as it is socially perceived by consumers. Criticality Inequality Similarity Assessment",
    "definition": "Inequality"
},
    {
        "term": "Which of the following statements about research are valid? A. Research has to be purely speculative, disconnected from practical concerns that would only be distractions. B. Research is only inspired by practical problems observed in the physical world. C. Research is only a hobby of talented individuals, who can afford investing their time and effort in it. D. Research may generate new knowledge. New knowledge may generate innovations that may favor progress of society. E. Research does not require other investments than salaries for researchers.",
        "definition": "D. Research may generate new knowledge. New knowledge may generate innovations that may favor progress of society."
    },
    {
        "term": "Which of the following statements about societal investments in research are valid? A. Research is a luxury. Investments are only justified in periods of economic growth. B. Society invests in research as a way to reduce unemployment. C. Research is a burden for taxpayers. Investments in research should only be made if achievement of practically useful results is guaranteed upfront. D. Investments are made because research can lead to useful innovations and progress of society. E. Society invests in research because it may generate new knowledge and knowledge is a human aspiration.",
        "definition": "D. Investments are made because research can lead to useful innovations and progress of society. E. Society invests in research because it may generate new knowledge and knowledge is a human aspiration."
    },
    {
        "term": "This question is about originality. When can a research result be defined original? A. The research result was not known before. B. The process through which the research lead to the result is novel. C. The research result can lead to a useful product. D. The research result was unexpected. E. The research result was very hard to achieve.",
        "definition": "A. The research result was not known before. B. The process through which the research lead to the result is novel. D. The research result was unexpected."
    },
    {
        "term": "This question is about significance. When can a research result be defined significant? A. The research result was unexpected. B. The research result may be used by other researchers to advance their research. C. The research result was not known before. D. The research that produced the result required a very substantial funding. E. The research result may lead to an improvement of a certain practical process, which reduces its cost and improves its performance.",
        "definition": "B. The research result may be used by other researchers to advance their research. E. The research result may lead to an improvement of a certain practical process, which reduces its cost and improves its performance."
    },
    {
        "term": "This question is about rigor. When can a research result be defined rigorous? A. The research result is properly formalized in mathematical form, and definitions and proofs are described clearly, correctly, and elegantly. B. The research result is a new artifact, whose design and validation are clearly and thoroughly described. C. The research result may be used by other researchers to advance their own research. D. The research result solves an open problem that has been studied for many years. E. The research result is of theoretical nature.",
        "definition": "A. The research result is properly formalized in mathematical form, and definitions and proofs are described clearly, correctly, and elegantly. B. The research result is a new artifact, whose design and validation are clearly and thoroughly described."
    },
    {
        "term": "Which of the following statements about the distinction between basic and applied research are acceptable? A. Basic research only requires \"paper and pencil\". No special equipment is needed. B. The spectrum between basic and applied research is continuous and a researcher may engage in both kinds of research during his/her work. C. Basic research inevitably leads to discoveries that can then be transformed by applied research into practical industrial innovations. D. Basic research is so fundamentally different from applied research that a researcher has to specialize and choose between the two upfront. E. Applied research is a less valuable (and prestigious) kind of research than basic research.",
        "definition": "B. The spectrum between basic and applied research is continuous and a researcher may engage in both kinds of research during his/her work."
    },
    {
        "term": "Which of the following statements about funded research programs are appropriate? A. A top-down research program only funds research that aims at an empirical evaluation in a practical setting of previously achieved theoretical results. B. A bottom-up research program allows researchers to select any possible research topic, and proposals are selected for funding only based on their originality, significance, and rigor. C. A top-down research program defines precisely the research topics that can be funded and should be addressed by applicants. D. A bottom-up research program only supports research that is motivated by current, practical needs of industry. E. A top-down research program gives researcher maximum freedom in selecting research topics.",
        "definition": "B. A bottom-up research program allows researchers to select any possible research topic, and proposals are selected for funding only based on their originality, significance, and rigor. C. A top-down research program defines precisely the research topics that can be funded and should be addressed by applicants."
    },
    {
        "term": "Tick one or more of the following statements, which properly describes the scientific method, originated in the 17th century by scientists like Galileo, Newton, and others. A. The method assures that a certain theory explaining a natural phenomenon is valid (i.e., it is an undisputable truth) after carefully chosen experiments confirm it. B. The method is purely theoretical, and does not require any experiments. C. The method consists of observing a natural phenomenon under study, postulating a theory that explains it, and devising carefully chosen experiments to confirm or disprove the theory. D. The method is based on validation of a theory by randomly generated experiments. E. The method requires explaining the natural phenomenon under study avoiding the use of mathematics.",
        "definition": "C. The method consists of observing a natural phenomenon under study, postulating a theory that explains it, and devising carefully chosen experiments to confirm or disprove the theory."
    },
    {
        "term": "What is a null hypothesis? Tick the correct answer. A. Hypothesis that further experiments disprove. B. An obviously wrong hypothesis that does not explain a certain phenomenon. C. No hypothesis made. D. Hypothesis made by inexperienced scientist. E. Hypothesis framed in a negative form, which researchers try to reject to confirm a theory.",
        "definition": "E. Hypothesis framed in a negative form, which researchers try to reject to confirm a theory."
    },
    {
        "term": "A scientific theory... (tick one) A. Is guaranteed to be unfalsifiable when it is published. B. Is valid until further findings disprove it. C. Is valid if a majority vote of researchers approves it. D. Must be stated as an absolute truth. It is guaranteed that it will never be falsified by further experiments. E. Must always be described as a set of mathematical formulae.",
        "definition": "B. Is valid until further findings disprove it."
    },
    {
        "term": "Deduction vs. induction. Tick the correct statements: A. Deductive inferences can be used to generate predictions from a given theory. B. Modus ponens is a typical deductive inference rule. C. In deductive inference, the consequences of true premises must be further validated by experiments before they can be accepted as a truth. D. In deductive inference, the consequences are guaranteed to be true if premises are true. E. Inductive inferences always lead to necessary conclusions.",
        "definition": "A. Deductive inferences can be used to generate predictions from a given theory. B. Modus ponens is a typical deductive inference rule. D. In deductive inference, the consequences are guaranteed to be true if premises are true."
    },
    {
        "term": "Consider the following statements: All beans in the bag are white These beans are from the bag These beans are white Which of the following statements about inferences are correct? A. The inference rule b ∧ c ⊢ a is an induction and leads to a non-necessary conclusion. B. The inference rule a ∧ b ⊢ c is a deduction and leads to a necessary conclusion. C. The inference rule b ∧ c ⊢ a is a deduction and leads to a necessary conclusion. D. The inference rule a ∧ c ⊢ b is an deduction and leads to a necessary conclusion. E. The inference rule a ∧ c ⊢ b is an induction and leads to a non-necessary conclusion.",
        "definition": "B. The inference rule a ∧ b ⊢ c is a deduction and leads to a necessary conclusion."
    },
    {
        "term": "Soundness vs. completeness of a theory of a certain phenomenon. Tick the correct statements. A. A theory for a given phenomenon is complete if all its predictions are possible manifestations of the phenomenon. B. A theory for a given phenomenon is complete if it predicts all the possible manifestations. C. A complete theory for a given phenomenon can predict impossible manifestations. D. Ideally, a theory should be both sound and complete. E. A theory for a given phenomenon is sound if all its predictions are possible manifestations of the phenomenon.",
        "definition": "B. A theory for a given phenomenon is complete if it predicts all the possible manifestations. D. Ideally, a theory should be both sound and complete. E. A theory for a given phenomenon is sound if all its predictions are possible manifestations of the phenomenon."
    },
    {
        "term": "Consider the following statements about precision and recall of an algorithm. Which are correct? A. Either precision or recall must be equal to one for an approximate algorithm to be acceptable. B. Precision is less than one for algorithms that compute false positives. C. If we are given two approximate algorithms for the same problem, they can they differ in precision and recall. D. Recall is less than one for algorithms that produce false negatives. E. Precision and recall are equal to one for algorithms computing exact solutions.",
        "definition": "B. Precision is less than one for algorithms that compute false positives. C. If we are given two approximate algorithms for the same problem, they can they differ in precision and recall. D. Recall is less than one for algorithms that produce false negatives. E. Precision and recall are equal to one for algorithms computing exact solutions."
    },
    {
        "term": "Consider the following statements about case studies in research. Tick the pertinent answers. A. A case study is never applied in research. It is only used as a didactic aid. B. A case study is a study of a legal action. C. A case study never requires threat analysis. D. Threat analysis should be applied to assess internal and external validity of the conclusions drawn from a case study. E. A case study may concern the use of a proposed new artifact or method in a given context to validate its usability in a practical setting.",
        "definition": "D. Threat analysis should be applied to assess internal and external validity of the conclusions drawn from a case study. E. A case study may concern the use of a proposed new artifact or method in a given context to validate its usability in a practical setting."
    },
    {
        "term": "Consider an algorithm that is supposed to find all possible occurrences in a text of person's names. We are aware of the difficulty of the problem, and we expect the algorithm to provide an approximate solution. In some cases, understanding whether a word represents a person's name may in fact require deep semantic understanding of the text. Being an approximation, the algorithm may provide false positives and false negatives. Which of the following statements are correct? A. The algorithm finds a name that is not a person's name. This is a false negative. B. The algorithm finds a name that is not a person's name. This is a false positive. C. The algorithm may both find a name that is not a person's name and may fail to find the occurrence of certain person's names. In this case the algorithm is simply an unacceptable approximation. D. The algorithm may find a name that is not a person's name and may fail to find the occurrence of certain person's names. In this case the algorithm can generate both false positives and false negatives. E. The algorithm does not find the occurrence of certain person's names. This is a false positive.",
        "definition": "B. The algorithm finds a name that is not a person's name. This is a false positive. D. The algorithm may find a name that is not a person's name and may fail to find the occurrence of certain person's names. In this case the algorithm can generate both false positives and false negatives."
    },
    {
        "term": "You are asked to review a survey paper. In which of the following dimensions you are not expecting the paper to be particularly strong? Tick one. A. Originality B. Significance C. Rigor",
        "definition": "A. Originality"
    },
    {
        "term": "You are asked to review a theoretical research paper. In which of the following quality dimensions you expect the paper to be particularly strong? Tick one. A. Rigor B. Significance C. Originality",
        "definition": "A. Rigor"
    },
    {
        "term": "The following statements are about journal and conference publication. Tick the ones that are valid: A. Journals are always more selective and prestigious venues than conferences. B. The publication process for conferences normally takes longer than for journals, and duration can be unpredictable. C. The publication process for journals normally takes longer than for conferences, and duration can be unpredictable. D. In certain scientific areas conferences and journals are equally selective and respected publication venues. E. Conference publication has no scientific value. It is only done as a social activity. This is true for all scientific areas.",
        "definition": "C. The publication process for journals normally takes longer than for conferences, and duration can be unpredictable. D. In certain scientific areas conferences and journals are equally selective and respected publication venues."
    },
    {
        "term": "The publication process relies on peer review. Which of the following statements are valid? Tick them. A. Peer review is a voluntary service activity done to support the research community. B. To reach better insights into a submitted paper, it is advisable that peer review is delegated to close colleagues of the authors, especially those who have been previous collaborators. C. The goal of peer review is to ensure that published results meet certain quality standards. D. The main goal of peer review is to ensure proper balance among different nationalities of contributors of accepted papers. E. To avoid bias, peer reviewers should not be experts in the field of the contribution.",
        "definition": "A. Peer review is a voluntary service activity done to support the research community. C. The goal of peer review is to ensure that published results meet certain quality standards."
    },
    {
        "term": "Which of the following are valid statements about peer review? Tick them. A. In a \"double blind\" review process not only the identity of the reviewers is undisclosed to the authors, but also the identity of the authors is hidden to the reviewers, to reduce bias. B. The typical situation is that the identity of reviewers is unknown to the author of a submitted paper. C. A \"double blind\" review process allows authors to submit two related papers to the same venue and have them reviewed by the same set of anonymous reviewers. D. The typical situation is that the author of a paper knows the identity of peer reviewers and interacts with them throughout the review process, if necessary. E. A \"double blind\" review process requires exactly two anonymous reviewers for each submitted paper.",
        "definition": "A. In a \"double blind\" review process not only the identity of the reviewers is undisclosed to the authors, but also the identity of the authors is hidden to the reviewers, to reduce bias. B. The typical situation is that the identity of reviewers is unknown to the author of a submitted paper."
    },
    {
        "term": "Which of the following are valid statements about publications? Tick them. A. Every published book is uniquely identified by its ISBN. B. Most professional societies publish journals and conference proceedings in their respective technical areas. C. A DOI allows unique access to digital objects, including papers and datasets. D. Publication has a legal purpose: it ensures 100% correctness of the reported results. E. The only possible form of publication is in printed form.",
        "definition": "A. Every published book is uniquely identified by its ISBN. B. Most professional societies publish journals and conference proceedings in their respective technical areas. C. A DOI allows unique access to digital objects, including papers and datasets."
    },
    {
        "term": "Which of the following statements about research artifacts are valid? Tick them. A. Research artifacts can be an essential complement to papers as a form of research diffusion. B. Making artifacts publicly available requires additional effort by researchers. As a benefit, their research may become more visible and their research impactful. C. Repeatability and replicability of research is supported by sharing artifacts. D. Peer review only applies to papers. Artifacts cannot be peer reviewed. E. Research artifacts, such as datasets, software tools, or simulations, only serve an ancillary purpose in the preparation of a paper and should be kept private. They have no use for others.",
        "definition": "A. Research artifacts can be an essential complement to papers as a form of research diffusion. B. Making artifacts publicly available requires additional effort by researchers. As a benefit, their research may become more visible and their research impactful. C. Repeatability and replicability of research is supported by sharing artifacts."
    },
    {
        "term": "Which of the following statements about Open Access are valid? Tick them. A. Open Access means that a research product is accessible on-line in digital form, only subject to a minimal access fee. B. Open Access means that a research product is accessible on-line in digital form, free of charge, and free of \"most\" copyright and licensing restrictions. C. In an Open Access scheme, authors can publish papers without undergoing any form of peer review. D. The notion of Open Access only applies to research papers and not to artifacts. E. No implementation of Open Access can charge a fee to a researcher to publish her product.",
        "definition": "B. Open Access means that a research product is accessible on-line in digital form, free of charge, and free of \"most\" copyright and licensing restrictions."
    },
    {
        "term": "Gold vs Green Open Access: which statements are correct? Tick them. A. Gold Open Access is a special label indicating the most downloaded papers from an online archive. B. A Green Open Access journal allows the author to publish a paper and share it with a selected set of people who must register to get access to it. C. A Green Open Access journal allows the author to publish a paper and then charge for accessing the related artifacts. D. Gold Open Access means that the author publishes his or her work on an Open Access journal, which makes the work immediately, publicly, and freely available to others. E. A Green Open Access journal allows the author to publish a paper and then self-archive a copy in a freely accessible institutional or specialist online archive (e.g., arXiv), or on the personal website.",
        "definition": "D. Gold Open Access means that the author publishes his or her work on an Open Access journal, which makes the work immediately, publicly, and freely available to others. E. A Green Open Access journal allows the author to publish a paper and then self-archive a copy in a freely accessible institutional or specialist online archive (e.g., arXiv), or on the personal website."
    },
    {
        "term": "How can we judge whether one is fit for research? Tick the pertinent answers. A. Interest in independent work. B. Interest in a job that will make one rich. C. Ability to think out of the box. D. Persistence in achieving results.",
        "definition": "A. Interest in independent work. C. Ability to think out of the box. D. Persistence in achieving results."
    },
    {
        "term": "Consider the following factors one may consider when choosing to enter a PhD program. Tick the three most important. A. Lively and competitive research environment. B. No checks on progress made by the department. C. Short distance from home. D. Presence of strong researchers in the areas in which you would like to work. E. Funding available for salary and travel.",
        "definition": "A. Lively and competitive research environment. D. Presence of strong researchers in the areas in which you would like to work. E. Funding available for salary and travel."
    },
    {
        "term": "This is a list of possible goals of a PhD student. Tick the three most important. A. Publish as many papers as possible. B. Work in complete isolation, to just focus on your own research. C. Find opportunities to get some teaching experience and/or student supervision. D. Make the software tool you develop as part of your research a visible and impactful artifact, downloaded by a large number of other researchers. E. Publish in top venues.",
        "definition": "C. Find opportunities to get some teaching experience and/or student supervision. D. Make the software tool you develop as part of your research a visible and impactful artifact, downloaded by a large number of other researchers. E. Publish in top venues."
    },
    {
        "term": "These are statements about networking as a PhD student. Tick the two most pertinent. A. You should only network for social events with the other PhD students inside your department. B. Networking is only a distraction from your main activity, which is doing research. C. By networking, you may become known to other, more experienced researchers who may help you in the future (e.g., write reference letters for you). D. Networking is only important when required by the funding agency supporting the research, as in the case of multi-site research programs. E. Networking allows you to establish possible research collaborations.",
        "definition": "C. By networking, you may become known to other, more experienced researchers who may help you in the future (e.g., write reference letters for you). E. Networking allows you to establish possible research collaborations."
    },
    {
        "term": "These are statements about research funding. Tick the three most pertinent. A. Research funding is only needed to support acquisition of expensive research equipment. B. Success in competitive research funding programs is an important achievement, which counts in a researcher's evaluation for hiring or promotion. C. Successful competition in research funding programs can be vital for a researcher's progress because in most cases their appointment does not include a research funding budget. D. Research is a purely intellectual activity. Funding may be needed only to cover a researcher's salary, if no other institution covers it. E. Research funding is highly competitive.",
        "definition": "B. Success in competitive research funding programs is an important achievement, which counts in a researcher's evaluation for hiring or promotion. C. Successful competition in research funding programs can be vital for a researcher's progress because in most cases their appointment does not include a research funding budget. E. Research funding is highly competitive."
    },
    {
        "term": "These are possible achievements of a junior researcher who is applying for a tenure-track position in a research-oriented academic environment. Tick the three most relevant for hiring. A. Advisor of Master students in research projects. B. Very prolific author of papers published in average-quality venues with high acceptance rate. C. Author of a very impactful paper, which describes a solution to an important open problem. D. Presenter of papers in average-quality conferences. E. Successful applicant in a very selective research funding program.",
        "definition": "A. Advisor of Master students in research projects. C. Author of a very impactful paper, which describes a solution to an important open problem. E. Successful applicant in a very selective research funding program."
    },
    {
        "term": "A junior researcher, after the PhD and a short period as a post-doc, applies for junior tenure-track position in an academic institution. Reference letters are asked to external experts. Tick the items in the following list which are expected to be in a reference letter. A. Comparison of scientific achievements of the candidate with top individuals in the same field with similar seniority. B. In the case where the expert is an editor of a journal and the candidate acted as a peer reviewer, comments on how accurate and helpful the reviews were. C. Comments on the applicant's presentation skills based on personal experience (e.g., having heard the candidate present in a conference or in a seminar). D. A justified opinion about the candidate's potential to become a research leader in his/her area. E. Comments on the applicant's personal life (e.g., family, hobbies, ...).",
        "definition": "A. Comparison of scientific achievements of the candidate with top individuals in the same field with similar seniority. B. In the case where the expert is an editor of a journal and the candidate acted as a peer reviewer, comments on how accurate and helpful the reviews were. C. Comments on the applicant's presentation skills based on personal experience (e.g., having heard the candidate present in a conference or in a seminar). D. A justified opinion about the candidate's potential to become a research leader in his/her area."
    },
    {
        "term": "Consider the case where a researcher applies for promotion from a non-permanent to a permanent academic position. The following statements refer to reference letters asked to external experts to support the promotion case. Tick the pertinent statements. A. Reference letters should only be asked to scientists who have worked directly with the candidate in the past. B. Reference letters should never comment on the candidate's performance as a peer reviewer. C. The applicant can suggest names of potential external reviewers and should select well known and respected scientists who are familiar with his work and who are likely to express a positive opinion. D. The applicant can suggest names of potential external reviewers and should select among scientists from other institutions who are not familiar with his work. E. Reference letter should contain an assessment of the candidate's proven skills as a supervisor and mentor of younger researchers.",
        "definition": "C. The applicant can suggest names of potential external reviewers and should select well known and respected scientists who are familiar with his work and who are likely to express a positive opinion. E. Reference letter should contain an assessment of the candidate's proven skills as a supervisor and mentor of younger researchers."
    },
    {
        "term": "Which of the following statements on paper citations are valid? Tick them. A. The number of citations received by a paper precisely measures impact of the research presented in a paper. If two papers have different numbers of citations, the one with a higher number has more scientific impact than the other. B. The previous statement is true if we exclude self-citations. C. The sole number of citations received by a paper does not offer any ground for judgement about its quality. D. The previous statement is true if we also assume that the two papers have been published in the same venue and in the same year. E. A paper which did not receive citations, or only received a few, ten years after publication is likely to have very low significance. This, however, has to be confirmed by further scrutiny.",
        "definition": "C. The sole number of citations received by a paper does not offer any ground for judgement about its quality. E. A paper which did not receive citations, or only received a few, ten years after publication is likely to have very low significance. This, however, has to be confirmed by further scrutiny."
    },
    {
        "term": "Which of the following statements on Impact Factor (IF) are valid? Tick them. A. IF cannot be applied to conferences. B. IF for a journal is a constant value. It does not change over time. C. IF is an objective and undisputable measure of the scientific reputation of a journal and should replace any subjective judgement of experts. If two journals have even slightly different IF values, a researcher should always try to publish in the one with higher IF. D. IF is an aggregate bibliometric indicator which is ultimately based the citations of papers published in a journal or conference. E. If two papers are published by journals with different IF, the paper published in the journal with higher IF has a higher quality.",
        "definition": "D. IF is an aggregate bibliometric indicator which is ultimately based the citations of papers published in a journal or conference."
    },
    {
        "term": "Which of the following statements on H-index are valid? Tick them. A. H-index for a researcher X is defined as the maximum value of h such that X has published h papers that have each been cited at least h times. B. H-index for a researcher X is defined as the average value h of citations received by all published papers by the researcher in the past ten years. C. H-index is an objective and undisputable measure of the scientific quality of researchers and should replace any subjective judgement of experts, especially when they are involved in hiring or promotion processes. If two candidates have different H-index values, the one with higher H-index should always be ranked higher. D. H-index for a researcher X is defined as the median value h of citations received by all published papers by the researcher in the past ten years. E. H-index is a bibliometric indicator that applies to researchers.",
        "definition": "A. H-index for a researcher X is defined as the maximum value of h such that X has published h papers that have each been cited at least h times. E. H-index is a bibliometric indicator that applies to researchers."
    },
    {
        "term": "Which of the following statements on quantitative evaluation via bibliometrics are valid? Tick them. A. Bibliometric indicators can be used to inform evaluation, but should never be a substitute for personal, detailed, and rigorous judgement by experts. B. A strength of bibliometrics is that all sources of bibliometric data (such as Google Scholar, ISI Web of Science, and Scopus) provide identical values for the same item (e.g., H-index). C. Bibliometric data are especially valuable for cross-sector comparisons. For example, to decide about allocation of funding among very different sectors (such as Mechanical Engineering or Biology) a reasonable choice might be to assess the average quality of researchers in the different sectors (e.g., averaging H-indexes) and allocate funding accordingly. D. Bibliometric indicators have no bias: they are objective, undisputable, and cannot be tweaked. E. Ultimately, bibliometric indicators are automatically computed numbers and may be used for automatic ranking. Despite minor pitfalls, they are always preferable to human judgement.",
        "definition": "A. Bibliometric indicators can be used to inform evaluation, but should never be a substitute for personal, detailed, and rigorous judgement by experts."
    },
    {
        "term": "Which of the following statements on ethics are correct? Tick them. A. Ethics is the philosophical study of wrong and right conduct, according to an ideal model. B. Ethics is the philosophical study of beauty and taste. C. A misconduct is a deviation from ethical principles. D. Ethical principles do not apply to scientific research. E. Misconducts can differ in severity.",
        "definition": "A. Ethics is the philosophical study of wrong and right conduct, according to an ideal model. C. A misconduct is a deviation from ethical principles. E. Misconducts can differ in severity."
    },
    {
        "term": "Which of the following statements on research misconduct are correct? Tick them. A. Reporting results of a made-up experiment that has never been done is a case of fabrication misconduct. B. A falsification misconduct may consist of designing experiments that try to falsify a theory. C. Fabrication is a research misconduct that refers to artifacts. It means that an artifact has defects and cannot be reused by other researchers. D. A submitted paper that reports fabricated data must be rejected. E. Manually tweaking some experimental results to make experiments look better is a case of falsification misconduct.",
        "definition": "A. Reporting results of a made-up experiment that has never been done is a case of fabrication misconduct. D. A submitted paper that reports fabricated data must be rejected. E. Manually tweaking some experimental results to make experiments look better is a case of falsification misconduct."
    },
    {
        "term": "Which of the following statements on plagiarism are correct? Tick them. A. Including figures from other papers can be done without giving credit. Copying figures is not a case of plagiarism. B. Including in a paper fragments of text from a paper by other authors, without giving credit, is an example of plagiarism. C. Plagiarism consists of not explicitly citing a highly related previously published paper. D. Whatever is found on electronic archives through Web browsing can be freely included in own papers without incurring in plagiarism. E. An author is allowed to copy text portions from a previous own paper into a new paper and is not required to cite the original paper. Because these texts are from the same author, this is not a case of plagiarism.",
        "definition": "B. Including in a paper fragments of text from a paper by other authors, without giving credit, is an example of plagiarism."
    },
    {
        "term": "Which of the following behaviors are clearly unethical? Tick them. A. One of your students helped you in implementing a simulation, whose results will appear in the experimental section of your paper. He is not listed as a co-author, but you decide to explicitly mention her in an acknowledgements section. B. A visiting researcher in your department gives a seminar on her on-going work and mentions a conjecture. She believes that a mathematical proof exists for it, but has not properly demonstrated it. You come out with a proof and submit a paper without citing her idea. C. One of your junior colleagues will soon be evaluated for promotion to a tenured position, and needs to strengthen his CV with more publications. To help him, you tell your PhD student who has done very good work to write a paper which includes also your colleague as a co-author, although he has not contributed. D. You review a paper in an area in which you are active and have already published. The paper under review has no specific relation with your earlier contributions; it just happens to be in the same general area. You strongly object to publication and ask for a major revision, requiring that the authors extensively cite your previous contributions in a \"related work\" section. E. To maximize probability of acceptance, you submit the same paper in parallel to two conferences.",
        "definition": "B. A visiting researcher in your department gives a seminar on her on-going work and mentions a conjecture. She believes that a mathematical proof exists for it, but has not properly demonstrated it. You come out with a proof and submit a paper without citing her idea. C. One of your junior colleagues will soon be evaluated for promotion to a tenured position, and needs to strengthen his CV with more publications. To help him, you tell your PhD student who has done very good work to write a paper which includes also your colleague as a co-author, although he has not contributed. D. You review a paper in an area in which you are active and have already published. The paper under review has no specific relation with your earlier contributions; it just happens to be in the same general area. You strongly object to publication and ask for a major revision, requiring that the authors extensively cite your previous contributions in a \"related work\" section. E. To maximize probability of acceptance, you submit the same paper in parallel to two conferences."
    },
    {
        "term": "A researcher is a member of a program committee which decides acceptance of papers submitted to a conference and one of her PhD student submits a paper. Can the researcher be one of the reviewers of the paper? A. Yes B. No",
        "definition": "B. No"
    },
    {
        "term": "A researcher is a member of a program committee which decides acceptance of papers submitted to a conference and one of her PhD student submits a paper. Can the researcher be present in the discussion about acceptance of the paper? A. Yes B. No",
        "definition": "B. No"
    },
    {
        "term": "A researcher is acting department chair. She is a member of a national committee which decides about funding. A member of her department submits a proposal. Can she participate in discussions that involve the proposal? A. Yes B. No",
        "definition": "B. No"
    },
    {
        "term": "A researcher 's promotion case is discussed in a department. Her partner in life is a senior member of the department. The two are not officially married. Should the senior member participate in the discussions and vote? A. Yes B. No",
        "definition": "B. No"
    },
    {
        "term": "Your department decides to recognize the best PhD thesis of the year with a special award. All members of the department vote their preferences. Should one be allowed to vote for the thesis of own students? A. Yes B. No",
        "definition": "B. No"
    },
    {
        "term": "You are asked to review a paper submitted for publication in a journal. Can you freely copy and circulate it to your students who are working on a project on the same topic? A. Yes B. No",
        "definition": "B. No"
    },
    {
        "term": "You submit a paper to conference which adopts a double-blind review process. Is your identity confidential information that the conference organizers cannot disclose to reviewers? A. Yes B. No",
        "definition": "A. Yes"
    },
    {
        "term": "You are a member of the program committee of a conference and participate in the discussions about acceptance of submitted papers. Later you chat with an author of an accepted paper. Can you disclose the names of the reviewers of the papers? A. Yes B. No",
        "definition": "B. No"
    },
    {
        "term": "You are a member of the program committee of a conference and participate in the discussions about acceptance of submitted papers. Later you chat with an author of a rejected paper. Can you disclose the names of the reviewers of the papers? A. Yes B. No",
        "definition": "B. No"
    },
    {
        "term": "You are a member of a panel in charge of selecting research projects for funding. A researcher who did not succeed in the competition contacts you, asking for advice on how to write a better proposal in the future. Can you pass a copy of a successful application for reference as a good example? A. Yes B. No",
        "definition": "B. No"
    },
    {
        "term": "You are asked to review a paper submitted for publication in a journal. The paper is an identical copy of a paper you previously reviewed for another journal. The paper was rejected for several serious concerns raised by the reviewers. Can your review, which recommends rejection, mention that the paper has been resubmitted with no change, completely ignoring the careful reviews received previously? A. Yes B. No",
        "definition": "A. Yes"
    },
    {
        "term": "You are asked to review a paper. Suppose you become aware of the identity of the other reviewers. Before you form your own opinion and write your review, you would like to contact the other reviewers asking their opinion about the paper, so that your review report can be in line with theirs. Is this an acceptable practice? A. Yes B. No",
        "definition": "B. No"
    },
    {
        "term": "You always say no to requests to review papers from journals with very low reputation and in all cases of predatory publishing. Is this an acceptable practice? A. Yes B. No",
        "definition": "A. Yes"
    },
    {
        "term": "You are a successful researcher, coordinating a group with several PhD students and post-docs, and coordinating three funded research projects. You submit for publication several papers a year. To maximize your research productivity, you decide that for a few years you will not accept to review any papers. Is this an acceptable practice? A. Yes B. No",
        "definition": "B. No"
    },
    {
        "term": "You have just completed your PhD and you receive a kind invitation from journal you never heard of before to become a member of their international editorial board. This is the first invitation you receive. Without any hesitation, you accept the invitation. Is this an acceptable practice? A. Yes B. No",
        "definition": "B. No"
    },
    {
        "term": "Human subjects can only be the subjects of research in life sciences and social sciences. A. Yes B. No",
        "definition": "B. No"
    },
    {
    "term": "What is the key to choosing good search terms?   think of several specific phrases to search think of one search term to use for all of your research think of several different general phrases to search use the same terms as the topic your teacher gives you",
    "definition": "think of several specific phrases to search"
}, {
    "term": "Choose the best search terms for the following topic: crime   auto-theft statistics in Chicago serious crime in the U.S.",
    "definition": "auto-theft statistics in Chicago"
}, {
    "term": "Choose the best search terms for the following topic: workplace ethics  office ethics paid paternity leave for new fathers",
    "definition": "paid paternity leave for new fathers"
}, {
    "term": "Choose the best search terms for the following topic: urban development  smoking rules in public housing urban development",
    "definition": "smoking rules in public housing"
}, {
    "term": "Choose the best search terms for the following topic: national security   visa screening policies immigration",
    "definition": "visa screening policies"
}, {
    "term": "Search engines like Google.com and Yahoo.com are the best places to do all your academic research. | True | False",
    "definition": "False"
}, {
    "term": "Search engines like Google.com and Yahoo.com are good places to start your academic research. | True | False",
    "definition": "False"
}, {
    "term": "Which of the following is NOT a very good search term for this topic? Topic: Gun Laws   guns gun laws in the U.S. the right to own a gun gun restrictions",
    "definition": "guns"
}, {
    "term": "According to the lecture, where is the best place to look for sources for a research paper?   library databases Google Scholar Google",
    "definition": "library databases"
}, {
    "term": " All of the following are questions to ask when determining reliability of a a source EXCEPT which one?   Who wrote the source? What is the date of the source? What is the purpose of the source? How long is the source? Is the source biased?",
    "definition": "How long is the source?"
}, {
    "term": " What is the first thing to do after you receive a research paper assignment?   Think of a research question. Make an outline. Write the thesis statement.",
    "definition": "Think of a research question."
}, {
    "term": " Most research papers share all of the following characteristics EXCEPT which one?   The have considerable length. They use sources. They are complex. They are worth 150 pts.",
    "definition": "They are worth 150 pts."
}, {
    "term": "True or False? Every research assignment you will be assigned in college will have different requirements.",
    "definition": "True"
}, {
    "term": "What is an annotated bibliography?   It is a list of articles related to your topic, and it summarizes and evaluates these. It is a list of articles by one author who is an expert on your topic. It is a list of articles that you plan to read for your research.",
    "definition": "It is a list of articles related to your topic, and it summarizes and evaluates these."
}, {
    "term": "  True or False? Most research assignments tell you the exact topic you should write about.  True False",
    "definition": "False"
}, {
    "term": "  True or False? A thesis statement is optional in your research paper.  True False",
    "definition": "False"
}, {
    "term": "True or False? An outline must include Roman numerals and capital and lowercase letters to keep it organized.  True False",
    "definition": "False"
}, {
    "term": "  True or false? For academic research, you should write complete sentences when you take notes on an article.  True False",
    "definition": "False"
}, {
    "term": "True or false? Most school library webpages have databases that anyone is free to use as long as they have an Internet connection.  True False",
    "definition": "False"
}, {
    "term": "  Which of the following is the most academic kind of source?  popular sources library databases news sources",
    "definition": "library databases"
}, {
    "term": " What is the purpose of an annotated bibliography?  to give you more work to do when you have a research assignment to help you think of search terms for your research to help you develop your research paper to help you summarize and evaluate your sources",
    "definition": "to help you summarize and evaluate your sources"
}, {
    "term": "True or False? You must always use a formal outline to plan an effective research paper.  True False",
    "definition": "False"
}, {
    "term": "Which of the following would be the most effective thesis statement for a research paper?  The tooth fairy and Santa Claus are imaginary characters for children. The U.S. government should require that all companies pay men and women the same amount of money for equal work. It's hotter in the oceans now than it was a few years ago, so something should be done about climate change. Terrorism is really awful, so governments should prevent it.",
    "definition": "The U.S. government should require that all companies pay men and women the same amount of money for equal work."
}, {
    "term": "True or False? An annotated bibliography for a college class is always written in MLA format.  True False",
    "definition": "False"
}, {
    "term": "True or False? It is ok to use contractions like \"can't\" and \"won't\" in your research paper so that you have more space on the pages to write about important ideas in your essay.  True False",
    "definition": "False"
}, {
    "term": "  Which of the following groups of words is definitely not on the Academic Word List?  evolve, generate, alter facilitate, prime, transit crash, cop, messy dynamic, prohibit, identical",
    "definition": "crash, cop, messy"
}, {
    "term": "True or False? Statistics can be used to start body paragraphs.  True False",
    "definition": "False"
}, {
    "term": "  Is this phrase appropriate for an academic essay? drunk as a skunk  Yes No",
    "definition": "No"
}, {
    "term": "Is this word appropriate for an academic essay? gonna  Yes No",
    "definition": "no"
}, {
    "term": "  Is this word appropriate for an academic essay? dummy  Yes No",
    "definition": "no"
}, {
    "term": " Is this word appropriate for an academic essay? increase  Yes No",
    "definition": "yes"
}, {
    "term": " True or False? You should use as many academic words as possible in your research paper even if you don't know what all of them mean.   True False",
    "definition": "False"
}, {
    "term": " Which of the following is not a reason to use a statistic in your research paper?   to support your point to make your paper longer some subjects depend on them",
    "definition": "to make your paper longer"
}, {
    "term": " Which of the following is not an appropriate place to use a statistic in your research paper?   as a detail to support your own point in the thesis statement as a hook in the introduction as one of several statistics in a statistics paragraph",
    "definition": "in the thesis statement"
}, {
    "term": " Which of the following groups of words is definitely not on the Academic Word List?  maintain, range, consume fund, contribute, imply context, identify, major snooze, nerdy, lame",
    "definition": "snooze, nerdy, lame"
}, {
    "term": "  Is this phrase appropriate for an academic essay? in his article   Yes No",
    "definition": "yes"
}, {
    "term": "Is this word appropriate for an academic essay? therefore   Yes No",
    "definition": "yes"
}, {
    "term": "Use this link to the Purdue Owl's MLA page to help you answer the following question. You will have to click on one of the tabs on the left menu of the webpage to find information about in-text citations. Purdue Owl MLA Which of the following does not use a correct MLA citation?   Wordsworth extensively explored the role of emotion in the creative process (263). Wordsworth stated that Romantic poetry was marked by a \"spontaneous overflow of powerful feelings\" (263). Romantic poetry is characterized by the \"spontaneous overflow of powerful feelings\" (Wordsworth, 1800, p. 263). Romantic poetry is characterized by the \"spontaneous overflow of powerful feelings\" (Wordsworth 263). Correct",
    "definition": "Romantic poetry is characterized by the \"spontaneous overflow of powerful feelings\" (Wordsworth, 1800, p. 263)."
}, {
    "term": "  What is the Purdue Owl?   It is a website with information to guide students in formatting their essays in MLA or APA format. It is the mascot of a famous soccer team. It is a website that will create a Works Cited page or References list for your research paper.",
    "definition": "It is a website with information to guide students in formatting their essays in MLA or APA format."
}, {
    "term": "  True or False? EasyBib is free to use for formatting in MLA and APA.  True False",
    "definition": "False"
}, {
    "term": "  If you were using EasyBib to help you create a Works Cited entry for an electronic news source, and EasyBib gave you the results below, what additional information would you have to provide in order to create the citation?  author, publisher, and publication date article title, publisher, and publication date author and publisher article title, author, and publisher",
    "definition": "article title, author, and publisher"
}, {
    "term": "  True or False? EasyBib always creates a correctly formatted Works Cited entry when you give it the correct information.  True False",
    "definition": "False"
}, {
    "term": "  True or False? If you paste a link to your online source in the EasyBib website, EasyBib will always supply all of the information you need to format your Works Cited entry.  True False",
    "definition": "False"
}, {
    "term": " Use the following link to the Purdue Owl website and click any tab you need to to answer the question below about this sample Works Cited page shown. Purdue Owl MLA (This will open in a new window.) In this Works Cited page using MLA 8th ed., which kinds of sources are A, B, and C? Choose the answer below that identifies all three sources correctly.   A. article with an author from an electronic source B. interview from an electronic source C. article with no author from an electronic source A. article with no author from an electronic source B. article with an author from an electronic source C. article with two authors from an electronic source A. article with an author from an electronic source B. article with no author from an electronic source C. printed book",
    "definition": "A. article with an author from an electronic sourceB. article with no author from an electronic sourceC. printed book"
}, {
    "term": " Use the following link to the Purdue Owl website and click on the MLA Abbreviations tab on the left. Then scroll down to find the answer to the question below. Purdue Owl MLA (This will open in a new window.) According to MLA 8th ed. what is the correct way to write the month, January, in the publication date for a journal in a Works Cited page?  January Jan. Jan Janu.",
    "definition": "Jan."
}, {
    "term": "  Use the following link to the Purdue Owl website and click on the appropriate tab on the left to answer questions about creating a Works Cited page for book sources. Purdue Owl MLA (This will open in a new window.) According to MLA 8th ed., which of the following is not a correct Works Cited entry for a book? ",
    "definition": "Hogan, Gina.B Building Better Paragraphs. Australia,...."
}, {
    "term": "What is EasyBib?   It's a website that helps students format their Works Cited page or References list. It's a piece of cloth that you easily tie around your neck to keep food off of your shirt when you eat. It's a website that will create a Works Cited page or References list for you.",
    "definition": "It's a website that helps students format their Works Cited page or References list."
}, {
    "term": "  True or False? Every research paper must have at least one statistic to make the essay effective.  True False",
    "definition": "False"
}, {
    "term": "  True or False? Statistics should not be used to start or end your body paragraphs.   True False",
    "definition": "True"
}, {
    "term": "  Is this expression appropriate for an academic essay? It's a piece of cake.  Yes No",
    "definition": "no"
}, {
    "term": "  Is this word appropriate for an academic essay? y'all  Yes No",
    "definition": "no"
}, {
    "term": " Which of the following groups of words is definitely not on the Academic Word List?  trashy, know-it-all, grouchy locate, remove, specify error, alter, reject capable, display, incorporate",
    "definition": "trashy, know-it-all, grouchy"
}, {
    "term": "  If you were using EasyBib to help you create a Works Cited entry for a YouTube video, and EasyBib gave you the results below, what additional information would you have to provide in order to create the citation?   the author of the video and publication date the title and author of the video the title and date accessed the author of the video and date accessed",
    "definition": "the author of the video and publication date"
}, {
    "term": "Use the following link to the Purdue Owl website and click on the MLA Abbreviations tab on the left. Then scroll down to find the answer to the question below. Purdue Owl MLA (This will open in a new window.) True or False? According to MLA 8th ed., you should write the complete publisher's name for a book in your Works Cited page. In other words, you should write the complete name instead of an abbreviated name.  True False",
    "definition": "TRue"
}, {
    "term": "Which of the following internet sites would be acceptable to use when searching for sources for a research paper?  www.google.com www.yahoo.com www.bing.com scholar.google.com",
    "definition": "www.google.com"
}, {
    "term": "  Which of the following is a good search term for this topic: Topic: the economy | financial crisis of 2008| raising interest rates| economics| home prices and the economy",
    "definition": "financial crisis of 2008"
}, {
    "term": "True or False? Creating an outline, either formal or informal, can help you organize your ideas so that you write a more logical research paper.  ",
    "definition": "True"
}, {
    "term": "All of the following are important to do in your writing to make your research paper academic and effective EXCEPT which one?   Avoid specific examples in your writing. Avoid overly emotional language in your writing. Avoid slang and cliché expressions in your writing. Use academic vocabulary instead of informal language.",
    "definition": "Avoid specific examples in your writing."
}, {
    "term": "Which of the following internet sites would be acceptable to use when searching for sources for a research paper?   www.google.com www.yahoo.com www.bing.com scholar.google.com",
    "definition": "scholar.google.com"
}, {
    "term": "Use this link to the Purdue Owl's MLA page to help you answer the following question. You will have to click on one of the tabs on the left menu of the webpage to find information on the Formatting and Style Guide. Purdue Owl MLA Which of the following is optional in MLA formatting?  the location of the source date of access author title of the source",
    "definition": "date of access"
}, {
    "term": "  According to the lecture, why should you take notes during your research?   so you can practice writing the research paper so you can avoid writing the research paper so you can organize your research",
    "definition": "so you can organize your research"
}, {
    "term": "  True or False? Most research papers are about 5 pages long.  True False",
    "definition": "False"
}
  ]
}
